import { useLocation } from "react-router-dom";
import Card from "../../components/Card";
import Footer from "../../components/footer";
import Header from "../../components/header";
import { data } from "../TextsPage/index";
const Text = () => {
  const location = useLocation();
  const { pathname } = location;
  const path = pathname.split("/").at(-1);
  const renderTitle = data.find((el) => el.link === path)?.title || "";
  const imgSrc = data.find((el) => el.link === path)?.image || "";
  function shuffle(array) {
    const clone = array.slice(0).filter((el) => el.link !== path);
    return clone.sort(() => Math.random() - 0.5);
  }
  const renderText = () => {
    switch (path) {
      case "qarlygashtyn-quirygy-nege-aiyr":
        return (
          <>
            <p>
              Күндердің бір күні Жылан жер жүзіндегі жанды мен жансыздарға
              мынадай арыз айтады:
            </p>
            <p>
              — Мені Тәңірім сендердің бәріңнен кем жаратыпты. Аяқ-қолым жоқ.
              Басымды көтере алмай, жер бауырлап қалдым. Не жеп, не қоярымды да
              білмеймін. Сендердің бәрің бір бүтін тілдісіңдер, ал мен айыр
              тілдімін. Ойлап отырсам, жанды мен жансыздың ішіндегі сорлысы мен
              екенмін. Маған ешқайсыңның жәрдем еткілерің келмейді. «Сен
              қасіретті көп тарттың, ондайлар әрдайым әділ келеді, сен
              барлығымызға патша да бола аласың» деп, сөзбен болса да жұбатып
              кетпейсіңдер, – деп, ол екі көзінен қанды жасын сорғалатып,
              ағыл-тегіл жылайды.
            </p>
            <p>
              Жанды-жансыздың барлығы жыланға аяныш білдіріп, өкпесін орынды
              көреді, «қарасың деп шықпайтын, қара қылды қақ жарған, ақ жүрек
              ақылшымыз болар» десіп, өздеріне патша етіп сайлайды.
            </p>
            <p>Жыл артынан жыл, күн артынан күн өтіп жатады.</p>
            <p>
              Күндердің күнінде Жыланекең: «Бүкіл әлемге патша болып, барлық
              билікті өз қолыма алсам, бұдан да жақсы тұрар едім. Көзіме
              көрінген тамақты ішпей, дүниедегі жандылардың ең тәтті қандысын
              жер едім», – деп қиялдайды. Қан дәмін айыра алатындарды шақыртады.
              Қос қанатын делдитіп, аяқтарын шілтитіп, қуарып Шіркей, тұмсығын
              едірейтіп Маса, патшаның көңілін табам деушілердің бәрі келеді.
            </p>
            <p>Патша осылардың ішінен Шіркей мен Масаға:</p>
            <p>
              — Жер жүзін аралап, өсімдіктердің дәмін татып, жанды-жансыздың
              қанын сорып қайтыңдар, тек бұлар ғана емес, қаттыдан тастың,
              жұмсақтан топырақтың да дәмін алыңдар. Дүниедегі ең тәтті зат
              бұдан былай менің тамағым болатындай етіңдер, – деп, уақыт кесіп,
              бүкіл әлемді шарлатып жібереді.
            </p>
            <p>
              Күн артынан күн өтіп, патшаның кесіп берген мезгілі де жетеді.
            </p>
            <p>
              Шіркей әлсіздігінен жел болса, шөптің түбіне қашып тығылып,
              тымықта ыңылдап ән салғансып жүріп, кешігіп қалады. Ал Маса
              өсімдік пен жандылардың ең тәттісін біліп алып, патшасына қарай
              әуелей ұшып, әндетіп келе жатқанда, Қарлығаш кез болады.
            </p>
            <p>
              — Иә, Маса досым, патшамызға ең тәтті тамақ іздеп кетті деп естіп
              едік, таптың ба?
            </p>
            <p>
              Маса Қарлығашты менсінбей, сұрағына жауап қатпай, зулай жөнеледі.
            </p>
            <p>
              — Ә, ә, түсіндім, түсіндім! Жолың болып, іздегеніңді тапқан
              екенсің, достым... Азаматсың өзің! Сенің ептілігіңді, еш нәрседен
              тайынбайтын бір беттілігіңді білгемін. Осы қасиетіңді енді барлық
              қанаттыларға айта жүретін боламыз, – деп, Қарлығаш Масадан сыр
              тарта, мадақтай сөйлейді.
            </p>
            <p>Бұл мақтауға Масаның есі шыға мастанып:</p>
            <p>— Патшамыздың тамағына кімді тапқанымды білесің бе?</p>
            <p>
              — Е, Маса досым, мен не білуші едім? Сізден денемнің үлкендігі
              болмаса, ақылым аз емес пе?! Сіз патшаның ақылшысысыз. Кәне,
              төрем, айтыңызшы, ардақты патшамыздың тамағына кімді таптыңыз?
            </p>
            <p>Маса еліре түсіп:</p>
            <p>— Дүниеде патшамызға лайықты ең тәтті тамақ адам қаны екен.</p>
            <p>
              «Һм... Адам сияқты ақылды да айлалы жан домаланған сілімтік
              жарымжанға жем болып қала ма» деп, қарлығаш бір амал ойлайды.
            </p>
            <p>
              — Менің ақылымның қысқалығы осы емес пе, Маса төрем! Адамның қаны
              тәтті дегеніңізге сенер-сенбесімді білмей келем. «Дүниеде тәтті
              қанды тауып, дәмін татқанның тіліне алтын мөр түсіп қалады» деп,
              шешем көп айтушы еді. Кәне, тіліңізді шығарып, мөріңізді
              көрсетіңізші! Алтын мөрге көз салғанның өзі біз үшін үлкен бір
              медеу ғой.
            </p>
            <p>Бұл мақтауға елірген ессіз Маса:</p>
            <p>
              — Көрсең, көре ғой, байғұс! – деп, тілін ұсынады. Қарлығаш шап
              беріп, Масаның тілін жұлып алғанда, ол сөйлей алмай, ыз-ыз етіп,
              патшасы Жыланға қарай ұша жөнеледі.
            </p>
            <p>
              «Қош, тілің жұлынды. Аузыңа құм құйылды. Адамның қанының
              тәттілігін енді қалай түсіндірер екенсің?» деген оймен Қарлығаш
              артынан ұшады.
            </p>
            <p>
              Маса бірдемелерді айтқысы келіп, ыз-ыз етіп зар қағады. Бірақ еш
              нәрсені түсіндіре алмайды Жыланға.
            </p>
            <p>
              — Мұның тілі аузынан түсіп қалған ба, немесе жынданған ба? Мынаның
              не деп тұрғанын түсінгендерің бар ма? – деп, Жылан тұрғандарға
              қарайды.
            </p>
            <p>— Өте түсінікті, патшам! – дейді Қарлығаш сонда.</p>
            <p>
              — Түн көрмей кетейін, бірдеңе ұқсам, кәне, түсінсең айтшы, не деп
              тұр?
            </p>
            <p>
              — Ызыңдап ұшып жүріп, бүкіл әлемді араладым. Бірақ неше түрлі
              өсімдікті өзі өсіріп шығарған топырақтан басқа еш нәрсені
              таппадым, - дейді патшам!
            </p>
            <p>
              Тілі сөйлеуге жарамаса да құлағы сау Маса мұны естігенде, жаны
              шығып кете жаздайды.
            </p>
            <p>
              Ол ызыңдап кеп, Қарлығашқа екі-үш рет тиіседі де Жыланның алдына
              барып жылап жібереді.
            </p>
            <p>
              — Ә, ә, мұның тіліне бір пәле қылған сен екенсің ғой, – деп, Жылан
              Қарлығашқа атылып кеп кетеді. Қарлығаш ұша жөнеледі.
            </p>
            <p>
              Жылан ұша жөнелген Қарлығаштың құйрығын ғана тістеп қалады. Жылан
              содан былай топырақ жалап, ал Маса ызылдап қалады. Адам жыланды
              көрсе өлтіріп, басын езетін болады. Қарлығаш жыланнан қорқып,
              адамды дос тұтып, үйдің төбесіне ұя салады, бірақ оның құйрығы
              кем, екі айырық, болып қалады.
            </p>
          </>
        );

      case "khaiuanattar":
        return (
          <>
            <p>
              Ерте заманда хайуандар жылдың басы болуға таласыпты. Сонда жылқы
              айтыпты:
            </p>
            <p>
              — Мен алысты жақын қыламын. Күшімді көреді, сүтімді ішеді, қылыма
              шейін арқан, жіп еседі. Адамға менен пайдалы мал жоқ, жыл ағасы
              мен боламын, – дейді.
            </p>
            <p>Түйе айтады:</p>
            <p>
              — Сен адамның жұмысын қылсаң, сұлы, шөп асайтын тамағың үшін құл
              болдың, міне, мен сен көтере алмайтын ауырды көтеріп, неше айшылық
              алыс жерлерге барамын. Аш болдым деп, арпа, сұлы сұрамаймын. Көде
              болса, көде, жусан болса, жусан, не кез келсе, соны қорек етіп,
              табылса, су ішіп, табылмаса, шөлде де жолға жүре беремін. Жыл басы
              болу маған лайық.
            </p>
            <p>Сиыр айтады:</p>
            <p>
              — Адам егін ексе, менімен егеді, сүтімді ішеді, құрт-май істейді,
              жыл басы болу маған лайық.
            </p>
            <p>Қой айтады:</p>
            <p>
              — Мен болмасам, қазақ үйін немен жабар еді. Жүнімді алып, киіз
              басады, жабағымнан киім тігеді, арқан, жіп еседі. Сүтімнен
              құрт-май алады, шаруаға менен пайдалыларың жоқ.
            </p>
            <p>Ит айтады:</p>
            <p>
              — Мен болмасам, сендердің көбіңді не ұрлап, не қасқыр жеп тауысар
              еді. Мен сендердің баршаларыңның бақташыңмын, дұшпан көрінсе,
              үріп, абалап, иеме хабар беремін.
            </p>
            <p>Тауық айтады:</p>
            <p>
              — Мен болмасам, кісі ерте жұмысына бармай, ұйықтап қалар еді. Мен
              ерте тұрып, таң атты деп шақырып, хабар айтамын. Кеш болса, жатар
              мезгіл болды деп, тағы шақырамын.
            </p>
            <p>
              Тышқан не айтарын білмей тұрады да бір түрлі қулық ойлап, жиылған
              көпке айтады:
            </p>
            <p>
              — Бұл таластан еш нәрсе өнбес, жылды қарап тұралық та кім бұрын
              көрсе, сол жыл басы болсын.{" "}
            </p>
            <p>
              Өзгелері қарап тұрғанда, түйе өзінің бойына сеніп: «Менен бұрын
              кім көреді?», – деп, тышқанның сөзін қостайды. Бөрі қарасып
              тұрады.   Біраздан соң тышқан жорғалап, түйенің өркешіне шығып
              отырады. Көп хайуан таласып: «Біз көреміз, біз көреміз», – деп
              тұрғанда, ең биікте отырған тышқанды көріп, еш нәрсе демепті.
            </p>
            <p>
              Сонан соң жылды бәрінен бұрын тышқан көріп, хабар беріп, жыл басы
              болыпты. Түйе бойына сеніп құр қалыпты.
            </p>
          </>
        );

      case "qanbaq-shal":
        return (
          <>
            <p>
              Бұрын, бұрын, бұрында Қаңбақ шал деген шал болыпты. Мал мен басқа
              зар болыпты. Кедейліктен шықпапты. Ол ау салып, балық ұстап, тамақ
              асырапты. Жел соқса, шал домалап жөнеледі екен. Содан оған Қаңбақ
              шал деп ат қойылған екен. Күн сайын ауына ілінген екі балығының
              біреуін бір түлкі әлімжеттік қып тартып жей береді екен. Түлкінің
              қорлығына шыдай алмай, шал бір күні екінші жерге көшем деп,
              дүние-мүлкін арқалап жолға шығыпты. Шаршаған соң оны бір жерге
              көміп кетіпті; бір жерге елдің сойған малынан жинап алған
              ішек-қарнын көміп кетіпті; бір жерге қарындағы айранын көміп
              кетіпті. Жүктің салмағымен Қаңбақ шал ұшып кетпей келеді. Жүктен
              арылған соң, желмен ұшып, бір жерге түсіпті.
            </p>

            <p>
              Қараса, бір дәу екі тауды біріне-бірін шақпақ қылып, ұрып тұр
              екен. Дәу:
            </p>
            <p>
              — Қайда бара жатқан шалсың? Кел, екеуміз күш сынасайық! – деп
              қазандай бір қара тасты көтеріп, аспанға лақтырып жіберді де,
              қайта қағып алып: «Ал, шал, сен де осылай қақпақыл етші!» - дейді.
            </p>
            <p>
              Шал сасып, қайтерін білмей, тасты құшақтап аспанға бір, тасқа бір
              қарап, күнімен тұрады. Сонда дәу:
            </p>
            <p>— Е, неғып тұрсың? Лақтыр! – дейді.</p>
            <p>Шал тұрып:</p>
            <p>
              — Аспанға лақтырсам, «аспан айналып жерге түседі-ау деп, жерге
              қақпай түсірсем, жер ортасынан ойылып түсе ме?» деп, қауіп қылып
              тұрмын! – дейді.
            </p>
            <p>Сонда дәу келіп, шалдың қолынан ұстай алады да:</p>
            <p>
              — Ақсақал, лақтырмай-ақ қой, текке қырыламыз! – деп жалынып
              қойғызады.
            </p>

            <p>Дәудің ақылы тайыздығын біліп, шал ерленіп, дәуге:</p>
            <p>— Кел, жердің ішек-қарынын шығарайық! – дейді.</p>
            <p>
              Дәу жүгіріп келіп, жерді теуіп қалады. Жер тізеден ойылады. Ештеңе
              шықпайды. Шал өзі бұрын көміп қойған, қан-жыны арылмаған
              ішек-қарын жатқан жерді жүгіріп барып, теуіп қалса, ішек-қарын
              шыға келеді. Дәу қорқады.
            </p>

            <p>Сосын шал:</p>
            <p>— Кел, енді жердің миын шығарайық, - дейді.</p>
            <p>
              Дәу бар пәрменімен келіп, жерді теуіп қалады. Жер тағы да тізеден
              ойылады. Ештеңе шықпайды. Шал манағы айранын көміп кеткен жерді
              жүгіріп барып теуіп қалса, бырқ етіп айран шыға келеді. Дәу одан
              бетер қорқады. «Мына шал не деген орасан күшті» деп, шалдың
              айтқанын істей береді. Ақыры шал онан қалай құтыларын білмей:
            </p>
            <p>— Енді қайт! Ертең бізге қонаққа кел, - дейді.</p>
            <p>Дәу:</p>
            <p>— Жарайды, - деп кетіп қалады.</p>

            <p>Шал үйіне келіп, кемпіріне:</p>
            <p>— Ертең дәу қонаққа келеді, - дегенде:</p>
            <p>— Ойбай, немізді береміз? – деп сасады кемпір.</p>
            <p>Шал тұрып:</p>
            <p>
              — Ертең дәу келеді. Мен есіктің алдында отырармын. Сонда сен оның
              көзінше: «Не істеймін, шал?» - деп маған қара, мен не десем, соны
              істемекші болып, пышақты алып тұра ұмтыл! – деп, кемпіріне үйретіп
              қояды.
            </p>

            <p>
              Ертеңіне үш дәу келіп, досының үйінде отырады. Сол кезде кемпір
              отырып:
            </p>
            <p>— Шал, нені асамын үйдегі қонаққа? Түк жоқ! – депті.</p>
            <p>Сонда шал тұрып:</p>
            <p>
              — Басқы дәудің басын ас, ортаншы дәудің төсін ас, ол жетпесе досым
              дәудің өзін ас! – дегенде, кемпір пышағын алып, тұра ұмтылады.
            </p>
            <p>
              Үш дәу тырым-тырақай қаша жөнеледі. Досы лашық үйін басымен
              көтеріп, алып кетеді. Шал айқайлап:
            </p>
            <p>
              — Әй, досым, лашығымды тастап кет! Қайда барсаң да, құтылмайсың! –
              дейді.
            </p>
            <p>
              Дәу лашықты тастай сала қашып бара жатса, баяғы әлімжеттік қып
              балығын тартып жей беретін түлкі жолығады.
            </p>

            <p>— Тақсыр, қайдан қашып келесің? – дейді түлкі.</p>
            <p>
              — Бір пәле шалдың қырсығынан құтыла алмай, қашып келеміз, - дейді
              дәулер.
            </p>
            <p>Түлкі:</p>
            <p>
              — Сол Қаңбақ шалдан қорқып жүрсіндер ме? – Менімен жүр, мен сенің
              өшіңді алып берейін, - деп, дәуді ертіп, шалды іздеп қайта келе
              жатса, шал лашықтың жанында тұр екен. Түлкінің ертіп келе жатқанын
              көріп, шал айғай салады:
            </p>
            <p>
              — Ей түлкі-ау? Арғы атаңда алты атамның құны бар, бергі атаңда бес
              атамның құны бар, өзіңде бітіспейтін кегім бар, үш дәуді соның
              үшін бергелі келе жатырсың ғой! Бәрібір онымен бітпеймін! – деп
              дауыстайды.
            </p>
            <p>
              Сонда дәу қорқып: «Бұл бізді құртайын деп әкеле жатыр», деп
              түлкіні құйрығынан алып жерге бір ұрып өлтіріп, алды-артына
              қарамастан қаша жөнеледі. Сөйтіп, Қаңбақ шал дәулер мен түлкіден
              осылай құтылған екен дейді.
            </p>
          </>
        );
      case "maqta-qyz-ben-mysyk":
        return (
          <>
            <p>
              Баяғыда Мақта қыз болыпты. Мақта қыз үйін жинап жүріп, бір мейіз
              тауып алады да, мысықты шақырады, Мысық келмейді. Қыз:
            </p>
            <p>
              — Келмесең келме! – деп, мейізді өзі жеп қояды. Жеп болған соң
              мысық келіп:
            </p>
            <p>— Неге шақырдың? – деп сұрайды.</p>
            <p>Мақта қыз айтпайды. Сонан соң мысық:</p>
            <p>— Ендеше қатығыңды төгем! – дейді.</p>
            <p>Мақта қыз:</p>
            <p>— Мен құйрығыңды кесіп аламын! – дейді.</p>
            <p>
              Мысық қатықты төгеді. Мақта қыз мысықтың құйрығын кесіп алады.
            </p>
            <p>Мысық:</p>
            <p>— Апа, апа, құйрығымды берші! – дейді.</p>
            <p>Мақта қыз:</p>
            <p>— Менің қатығымды төле! – дейді.</p>

            <p>Мысық сиырға барады:</p>
            <p>— Сиыр, маған қатық берші! – дейді.</p>
            <p>Сиыр:</p>
            <p>— Менің қарным ашып тұр. Маған жапырақ әкеліп берші! – дейді.</p>

            <p>Мысық ағашқа барып:</p>
            <p>— Ағаш, ағаш, жапырағыңды берші! – дейді.</p>
            <p>Ағаш:</p>
            <p>— Мен шөлдеп тұрмын. Су әкелсең, жапырақ беремін, – дейді.</p>

            <p>Мысық суға бара жатса, су әкеле жатқан қыздарды көреді:</p>
            <p>— Қыздар, қыздар, маған су беріңіздерші! – дейді.</p>
            <p>Қыздар оған:</p>
            <p>— Бізге сағыз әкеліп берсең, біз саған су береміз, – дейді.</p>

            <p>Мысық дүкенге барады:</p>
            <p>— Әй, дүкенші, маған сағыз берші! – дейді.</p>
            <p>Дүкенші:</p>
            <p>— Маған жұмыртқа бер! – дейді.</p>

            <p>Мысық тауыққа барады:</p>
            <p>— Тауық, тауық, маған жұмыртқа берші! – дейді.</p>
            <p>Тауықтар:</p>
            <p>
              — Бізге дән әкеліп берсең, біз саған жұмыртқа береміз, – дейді.
            </p>

            <p>
              Мысық: «Енді не қыламын?» – деп бара жатса, бір ін қазып жатқан
              тышқанды көреді. Мысық тышқанды бас салады:
            </p>
            <p>— Жаныңның барында айт! Үйіңде не бар? – дейді.</p>
            <p>Тышқан қорыққанынан:</p>
            <p>— Үйімде бір табақ тары бар, – дейді.</p>
            <p>Мысық:</p>
            <p>— Маған бір уыс тары бер, – дейді.</p>
            <p>
              Тышқан үйіне барып, бір уыс тары әкеліп береді; мысық тарыны
              апарып тауыққа береді, тауық жұмыртқа береді; жұмыртқаны апарып
              дүкеншіге береді; дүкенші сағыз береді; сағызды апарып қыздарға
              береді, қыздар су береді; суды апарып ағашқа береді; ағаш жапырақ
              береді; жапырақты апарып сиырға береді, сиыр қатық береді; қатықты
              апарып Мақта қызға береді, Мақта қыз мысықтың құйрығын береді.
            </p>
          </>
        );
      case "tazsha-bala":
        return (
          <>
            <p>
              Ертеде бір шал мен кемпір болыпты. Олардың үш баласы, бес ешкісі
              бар екен. Бір күні үлкен баласы басқа жерден пайда кәсіп қылуға
              талап етіп, өзіне тиген енші ешкісін сойып алып, етінен кемпір мен
              шалға бір түйір де берместен, арқалап кетіпті. Келе жатса, бір
              өнерші байдікіне келеді. Бұл байға өнер үйренуге ол жігіт
              жалданыпты. Өнерші бай бек қатты жауыз адам екен. Ол жалданған
              жігітті бір сандыққа салып қойып, аштан өлтіріпті.
            </p>

            <p>
              Үйінде қалған ортаншы баласы, бұ да өнер үйренбекке талап етіп, о
              да ағасының кеткен жолымен кетіп, о да өнерші байға келіп
              жалданыпты. Өнерші бай оны да ағасынша аштан өлтіріпті. Үшінші ұлы
              — Тазша бала, о да ағаларындай өзіне тиген енші ешкісін сойып
              алып, жарты етін әке-шешесіне беріп, олардан рұқсат алып, арқалап
              кетіпті.
            </p>

            <p>
              Келе жатса, бір қора қойға ұшырапты. Бұл қора қойдың қойшысына
              жолығып сұраса, бұл қойлар өнерші байдікі екен. Ол Тазшадан
              сұрайды:
            </p>
            <p>— Балам, қайда барасың? — деп.</p>
            <p>Тазша бала жауап береді:</p>
            <p>— Өнер үйренуге барамын, — деп.</p>

            <p>Сонда шал тұрып айтады:</p>
            <p>
              — Балам, бұл сөзіңді бөтен ешкімге айтпа, жатқа (бөтендерге)
              шыныңды айтпа деген, — деп.
            </p>

            <p>
              Сонан соң, бала «шалдың бұл айтқаны рас екен» деп ойлап, өнерші
              байға барыпты. Байдың үйіне қонып, ертең жүрейін деп жатқанда,
              өнерші бай Тазшадан сұрайды:
            </p>
            <p>— Балам, қайда барасың, жолың болсын? — деп.</p>

            <p>Тазша бала жауап береді:</p>
            <p>— Мен өзіңдей ер баласы жоққа еншілес бала боламын, — деп.</p>

            <p>Сонда өнерші бай айтады:</p>
            <p>
              — Балам, сен біздікіне қал, маған бала бол, біздің бір ақ құнан
              қойды сойып, той қылып, асық жілігін етімен өзің жеп той, мен өзім
              жолаушы барамын, — дейді де, өзі жолына кете береді.
            </p>

            <p>Тазша бала:</p>
            <p>— Хош әке, жақсы бол! — деп, үйінде қала беріпті.</p>

            <p>
              Бұл өнерші байдың үйінде бір қызы бар екен. Бұл Тазша балаға
              айтады:
            </p>
            <p>
              — Аға, сен асық жіліктен өзің жемей, керегенің басына іліп қой,
              сонда бір ақ тазы келіп, жілікке ұмтылар, сонда сен балтамен ол
              тазыны лақтырып өлтір, — деп.
            </p>

            <p>
              Мұнан соң Тазша бала ақ құнан қойды сойып, той қылып, көршілерін
              шақырып, асық жілігін өзі жемей, қыздың айтқанын қылып, керегенің
              басына іліп қойғанда, айтканындай ақ тазы келіп, етті жілікке
              ұмтылғанда, Тазша балтамен жіберіп қалыпты. Бірақ балтасы тазыға
              тимей, ит қашып құтылып кетіпті.
            </p>

            <p>
              Өнерші бай үйіне келген соң, Тазша баланың мұндай істерді
              істегенін біліп, қатты ашу етіп, «бұл итті аштан өлтірейін» деп
              сандыққа салып қойыпты. Бұл байдың бағанағы қызы, әкесі жоқта,
              сандығының түбін тесіп, тамақ беріп, Тазшаны тойдырып тұрыпты.
            </p>

            <p>
              Бірнеше күндер өткен соң, Тазшаның өз әкесі балаларын іздеп шығып,
              өнерші байдікіне келіп сұрады:
            </p>
            <p>— Бір Тазша деген балам бар еді, соны көрдіңіз бе? — деп.</p>

            <p>Өнерші бай:</p>
            <p>— Көргенім жоқ — деп жауап береді.</p>

            <p>
              Бұлардың сөйлесіп тұрған сөздерін Тазша үйде, сандықта жатып
              есітіп жатыр еді. Бай әлгідей дегенде, Тазша:
            </p>
            <p>— Әке, мен мұндамын! — деп сандық ішінен айқайлапты.</p>

            <p>
              Даусынан баласын танып, байдың сандығынан шығарып алып, Тазша мен
              әкесі үйіне қайтыпты.
            </p>

            <p>Тазша жолай әкесіне айтады:</p>
            <p>
              — Әке, мен бір қара құнан қой болайын, мойныма жіп тағып, жетектеп
              барып базарға жақсы бағаға сат, бірақ жібіңді алып қал, — дейді.
            </p>

            <p>
              Баласы сол жерде айтқанынша қара құнан қой болады, әкесі мойнына
              жіп тағып, базарға апарып сатып, ақшасын алып үйіне қайтады.
            </p>

            <p>Ертеңіне баласы өз қалпына түсіп, әкесіне айтады:</p>
            <p>
              — Әке, мен бір қара жорға ат болайын, мені базарға апарып сат,
              пұлымды ал, бірақ шылбырымды алып қал, — депті.
            </p>

            <p>
              Баласы айтқанынша ат болып, әкесі базарға апарып сатып, шылбырын
              алып, үйіне кайтты.
            </p>

            <p>
              Ертеңіне баласы, Тазша, тағы өз қалпына түсіп, үйіне келіп әкесіне
              айтады:
            </p>
            <p>
              — Әке, мен бір жез бұйдалы нартайлақ болайын, сен мені базарға
              апарып сат та, пұлымды алып, бірақ бұйдамды алып қалып, үйге қайта
              бер, — деді.
            </p>

            <p>
              Тазша айтқанынша тайлақ болып, әкесі базарға сатайын деп жетектеп
              келе жатса, алдынан баяғы өнерші бай шығыпты. Ол айтады:
            </p>
            <p>— Маған мынау тайлағынды сат, — деп.</p>

            <p>Тазшаның әкесі айтыпты:</p>
            <p>— Тайлағым басы жүз тілла, — деп.</p>

            <p>
              Сонда өнерші бай бұлардың айласын біліп, жаман оймен, тайлақты жүз
              тіллаға сатып алыпты да, үйіне жетектеп келіп, баяғы қызын шақырып
              алып, «мынау тайлақты ұстай тұр» депті де, өзі үйден пышақ алып,
              тайлақты бауыздайын деп, үйіне жүгіріп кетіпті.
            </p>

            <p>
              Қыз әкесінің жаман ниетін біліп, үйден бұ да пышақ алып шыққан
              екен, әкесі үйге кірген кезінде, тайлақтың бұйдасын пышақпен қиып
              жіберіп, босатып қоя беріпті.
            </p>

            <p>
              Өнерші бай тұра салып, үйінен шығып, қашып бара жатқан тайлақты
              көріп қуыпты. Тазша сонда түлкі болып қашыпты, өнерші бай тазы
              болып қуыпты, өнерші бай жете берген кезде, Тазша түлкіден үйрек
              болып ұшыпты, бай онда қаршыға болып қуыпты. Біраздан соң, Тазша
              бала Торғай болып қашыпты, онда бай қырғи болып соңына түсіпті.
            </p>

            <p>
              Онан соң Тазша Торғай қалпында шаңыраққа ұшып келіп қонып
              отырғанда, бай — қырғи келіп таяна бергенде, Тазша қорқып, шүберек
              болып жерге түсіпті. Өнерші бай онда кісі болып, шүберекті қолына
              алайын дегенде, Тазша тары болып домалапты. Онда өнерші бай тауық
              болып шұқиын дегенде, Тазша мысық болыпты да, өнерші байдың
              желкесіне мініп алып тістеп, тырнап, зорлықпен өнерші байды
              өлтіріпті. Сөйтіп, оның қызын өзі алып, барша мұратына жетіп, зор
              бай болып дәурен етіпті.
            </p>
          </>
        );
      case "shygaibai":
        return (
          <>
            <p>
              Ерте заманда, елдің етек – жеңі келте заманда, Шықбермес Шығайбай
              дейтін сараң бай болыпты. Мал – мүлкінде есеп болмапты. Бірақ
              байлығымен аты шықпай, сараңдығымен аты шығыпты... Сол Шықбермес
              Шығайбай үйіне ешкімді қондырмайды екен, қондырса да дәм беріп
              оңдырмайды екен. Үйіне кісі келсе, жоғары шық деудің орнына
              айтатын сөзі: «Шық, ай!» болыпты. Осыдан жұрт оны Шығайбай деп
              атап кеткен екен.
            </p>

            <p>
              Шықбермес Шығайбайдың аты естілмеген ел болмапты. Оның «Шық, әйін»
              естімеген жан болмапты.
            </p>

            <p>
              Тандыр толған ас болса да дәмін татам деген талайлардың тауы
              шағылып, құр ауыз қайтқан екен.
            </p>

            <p>
              Нақ сол тұста Алдар деген қу бар, Алдардың алдамайтыны,
              арбамайтыны жоқ деген атақ та ел – елге жайылған екен. Ел
              аузындағы мәтелге айналған екен.
            </p>

            <p>
              - Әй, Алдарың қанша қу болса да, Шықбермес Шығайбайды алдай алмас,
              дейді жұрт. Осы сөз Алдарға жетеді. Шықбермес Шығайбайдың атын
              Алдар да естиді.
            </p>

            <p>
              - Шықбермес Шығайбайды мырза бай етпесем? Алдар деген атым
              құрысын, - деп, Алдар атына мінеді. Шықбермес Шығайбайдың елі
              қайдасың деп іздеп кетеді. Күн-түн жүреді. Ақырында елден іргесін
              аулақ салған, ен далада жалғыз үй отырған Шығайбайдың үйіне
              келеді.
            </p>

            <p>
              «Не істеп отыр екен бұл қу?» - деп, атынан білдірмей түсіп,
              жабықтан сығалайды. Сығаласа, Шығайбай сап-сары қазыны кесіп отыр
              екен. Бәйбішесі қамыр илеп, тоқалы бас үйітіп, қызы тырнаның жүнін
              жұлып жатыр екен.
            </p>

            <p>
              - «Осы астан татпасам, Алдар деген атым құрысын!» - деп, алақанына
              түкіреді де:
            </p>

            <p>
              - Кеш жарық! – деп, жылмаң етіп, үйге кіріп келеді. Бұлар да
              жылдам екен, Алдар «Кеш...» дегенді айтып, аузын жиғанша,
              қолдарындағы астарын тыға қойып, Шығайбай таспаны, бәйбіше
              ұршықты, қызы тігіліп жатқан көйлекті, тоқалы көсеуді қолдарына
              алып отырыса қалады. Түк білмегенсіп, қолдарындағы істерімен
              айналысып, жайбарақат бола қалады.
            </p>

            <p>
              «Әй, әккі болған неме екенсіңдер, мызғымас қу екенсіңдер», - дейді
              Алдар ішінен. Амандасқансып, қол алысқансып, байға сүйкене барып,
              төр алдына отырып алды.
            </p>

            <p>
              «Ай, өзің иегіңде бір тал қылыштығың жоқ, сақал-мұрттан тұлдырсыз
              көсеудей көсе екенсің, жұртты құртқан сұм боларсың! Жүрісің жылмаң
              екен, бойың қылмаң екен, тұзақ үзген қу боларсың! Қу болсаң да,
              менен дым да тимес», -дейді бай ішінен.
            </p>

            <p>
              - Қайдан жүрген қаңғыбассың? Қайда барасың? Не естіген-білгенің
              бар? - дейді бай Алдарға, жақтырмағанын сездіре сөйлеп.
            </p>

            <p>Алдар көтеріле түсіп, күлімдеп, желдірте сөйлей жөнеледі.</p>

            <p>
              - Көрген, білгенім көп. Жолда келе жатып, үлкен сары жылан көрдім.
              Жуандығы тап өзіңнің астыңдағы сары қазыдай.
            </p>

            <p>Артық – кем асырмай, Шын айтқанда жасырмай.</p>

            <p>Таспен ұрдым жіберіп, Тоқал тыққан басындай.</p>

            <p>Былш етті иленіп, Бәйбіше астындағы қамырдай.</p>

            <p>Өтірік болса, сақалым жұлынсын, Қыз астындағы тырнадай.</p>

            <p>Бәрін де осының көріп келдім, Асыңды пісір, ұрламай!</p>

            <p>Осыны айтқаннан кейін бай:</p>

            <p>
              - Шоқ түссін тіліңе!-деп, астындағы қазысын лақтырып тастайды.
            </p>

            <p>
              - Тілің тасқа бітсін!-деп, бәйбіше астындағы қамырын лақтырады.
            </p>

            <p>
              - Жағың қарыссын!-деп, тоқал етегінің астындағы басын жібереді
              атып.
            </p>

            <p>
              - Тіліңе мерез шықсын!-деп, қыз етегінің астындағы тырнасын алып
              лақтырып жібереді.
            </p>

            <p>
              - Қазанды аса бер, бәйбіше,-дейді бай, «амал қанша» деген
              пішінмен.
            </p>

            <p>Бәйбіше қазанға ас салады да:</p>

            <p>- Піс, қазаным, бес ай!-дейді.</p>

            <p>
              - Отырайын он ай!-деп, Алдар етігін шешіп, лақтырып тастайды да,
              төрге жантая жайласады.
            </p>

            <p>
              Қазан түнімен қайнайды, бірақ түсірілмейді. «Қайнасаң қайна»-деп,
              бақшиып Алдар да отыра береді. «Мынау кәпір қашан жатады»-деп, үн
              жоқ, түн жоқ сазарып бай да орнынан тапжылмайды.
            </p>

            <p>Ақырында, бай шыдамай:</p>

            <p>
              - Әй, кемпір, сал төсекті!-дейді. Кемпірі төсек салады. Бәрі жатып
              қалады. «Жатсаң жат!»-деп, Алдар да қисаяды. Байдың көзі ұйқыға
              барды-ау деген кезде Алдар орнынан ұшып тұрып, қазандағы етті
              сүзіп алып, оның орнына тулақты турап-турап, салып қояды.
            </p>

            <p>Бір уақытта бай тұрып, кемпірін оятады.</p>

            <p>
              - Мына ит ұйықтады білем, түсір асыңды тез. Уақытымен асымызды
              жегізбеді-ау, ит!-дейді.
            </p>

            <p>
              Бәйбіше қараңғыда асын түсіреді. Бай пышақты қолға алып жіберіп:
            </p>

            <p>
              - Жат, жігітім, жат! Сазайың осы!-деп аузына бір кесегін салады,
              тісі өтпейді. Олай шайнайды, бұлай шайнайды, болмайды.
            </p>

            <p>
              - Етің не болып кеткен, өңшең шандыр ма, немене?-деп, кемпіріне
              ұрсады. Қатқан теріні ірідей жұтам деп, түйіліп қалып, май
              сұрайды.
            </p>

            <p>
              Кемпір кебежені ашып, аяққа май салады. Әдейі осыны аңдып жатқан
              Алдар орнынан тұрып барып, аяққа салынған майды ала қояды да, оның
              орнына іргеден сиырдың жас тезегін алып, табағына салып қояды.
            </p>

            <p>
              Шығайбай аяқты ала сала, былжырап тұрған жас тезекті май деп,
              қылғытып жұтып жібереді де, жүрегі айнып, лақ еткізіп құса салады.
            </p>

            <p>
              - Қазы орнына шандыр бердің, май орнына саңғақ бердің,
              алжыған!-деп, аяқпен кемпірін бір тебеді.
            </p>

            <p>
              Кемпірінің басы жарылып, ойбайлап қалады. Кемпірдің даусынан
              оянған болып, Алдар сыртқа шығады. «Бұл сұм бай менен өшін алмай
              қоймас, атыма бір зиян істеуі мүмкін»,-деп, атына барады. Атының
              қасында байдың да аты тұр екен. Өз атының маңдайындағы қасқасы
              болмаса, екеуінің ешбір айырмашылығы жоқ екен. «Менің атыма деп
              ойлаған қастығы болса, өзіңе болсын», -деп, өз атының қасқасына
              жас тезек жағып жоғалтады да, бай атының маңдайына бор жағып,
              қасқа ат қылып қояды. Сөйтеді де, орнына келіп жатып, ұйықтап
              қалады. Етті, майды жеп қойған Алдар екенін, оның жұрттан асқан
              бір қу екенін бай біледі. Біледі де ішін ыза кернеп: «Тұра тұр,
              бәлем!»-дейді. Алдар ұйықтады-ау деген кезде, сыртқа шығып,
              Алдардың аты екен деп, өз атын жарып тастайды.
            </p>
            <p>
              - Міне, жігітім, сазайыңды тартқыздым! -деп қуанып, төсегіне келіп
              жатып, ұйқыға кетеді.
            </p>

            <p>Таңертең бай орнынан тұрып жатып, Алдарға:</p>

            <p>
              - Мына кемпір бір қасқа ат өліп жатыр дейді. Қазыққа оралып,
              жарылып қалыпты. Сенің атың болу керек. Жалғыз атыңды бақпай,
              қазан бағып жүрген не қылған сорлы адамсың?-деп қарқ-қарқ күледі.
            </p>

            <p>Алдар иығынан күліп:</p>

            <p>
              - Қандай қасқа екен? Маңдайы тезек жаққан боқ қасқа болса, менікі
              болар, бор қасқа болса, сенікі болар,-дейді.
            </p>

            <p>
              Бай құдайдың дәл төбесінен қос қолдап ұрғанын сонда бір-ақ біледі
              де, орнынан тұра жүгіреді. Жүгіріп барса, нақ Алдар айтқанындай,
              өліп жатқан байдың бор қасқасы екен. Бай күйіп кетіп, Алдарға
              келіп:
            </p>

            <p>
              - Жоғалт қараңды сұм! Енді мен сені көрсем, көзім ағарсын!-деп,
              кейін шығып кетеді. Сыртқа шығысымен, кемпіріне:
            </p>

            <p>- Тез мені жөнелт!-дейді.</p>

            <p>
              Әйел ошақта пісіп жатқан нанды оттан суырып бере қояды. Бай
              қойнына тығып жібереді. Мұны көре сала, Алдар жүгіріп шығады.
              Жүгіріп шығып:
            </p>

            <p>
              - Е, байеке! Енді бұдан былай жолығамыз ба, жоқ па? Ақтық рет
              қазақ дәстүрімен көрісіп айырылысайық,-деп бара байды қапсыра
              құшақтайды. Оттан жаңа ғана шыққан нан байдың кеудесін күйдіріп
              кетеді.
            </p>

            <p>
              - Оу, жарайды енді!-деген сайын, қыса түседі, ыстық нан байдың
              төсін күйдіріп барады.
            </p>

            <p>
              - Ау мына ит жегіріңді ит жесін! Мә!-деп, қойнынан нанды алып
              лақтырып жібереді.
            </p>

            <p>
              - О, байеке, ит жегенше, мен жейін,-деп, Алдакең нанды жерге
              түсірмей қағып алады. Бай енді кетейін десе, Алдар тағы
              жібермейді.
            </p>

            <p>- Ау, сұм! Алатын наныңды алдың, енді нең бар менде?-десе:</p>

            <p>
              -Етігім жыртылып, шұлғауым шығып жүр. Бізіңді беріп кет,-дейді.
            </p>

            <p>Байдың бергісі келмейді. Алдар аш кенедей жабысып жібермейді.</p>

            <p>Ақыры, болмаған соң:</p>

            <p>
              - Әй, алсаң алшы, ант ұрған! Ал да, қаранды жоғалтшы,
              кәпір,-дейді.
            </p>

            <p>
              Алдар «алғысын» жаудырмалатып, күліп қала береді. Бай кетісімен,
              кемпіріне жүгіріп келіп:
            </p>

            <p>- Ал қызыңызды киіндіріңіз,-дейді.</p>

            <p>- Е,қызға жол болмасын?</p>

            <p>- Баймен келісіп, қызыңды алатын болдым.</p>

            <p>
              - Жоғал әрі, жұртты жалмаған қу көсе! Саған қызын беретін бе еді?
            </p>

            <p>
              - Сенбесең, өз құлағыңмен естіп ал,-деп сыртқа шығып, көп жерге
              барып қалған байдың артынан айқайлайды:
            </p>

            <p>- Әй,бай! Қызыңды бермей жатыр кемпірің,-дейді.</p>

            <p>
              - Әй,кемпір! Бер бізді! Жоғалт сол кәпірдің көзін,-деп айқайлайды
              бай.
            </p>

            <p>- Әні,естідің бе?-дейді Алдар қасында тұрған бәйбішеге.</p>

            <p>
              - Мына кәрі ит алжыған ба өзі ?Елді құртқан бір қу аяққа қызын
              беріп құтырған ба?-деп,таң қалады кемпірі.
            </p>

            <p>
              Қатын-қалашқа бой беретін Алдар ма! Анау-мынау дегенге көнбестен,
              жасауын буып, қызды атқа мінгізеді.
            </p>

            <p>
              - Алдардың ойыны осылай болады, -деп қызды қосағына алып, еліне
              тартып отырады.
            </p>
          </>
        );
      case "shal-men-dau":
        return (
          <>
            <p>
              Ерте, ерте, ертеде, ертеден де ертеде бір кемпір мен шал өмір
              сүріпті. Олардың баласы болмапты және өздері кедей екен. Шал аң
              аулап, екеуі сөйтіп күндерін көріпті. Бір күні шалдың құрып қойған
              торына бір қарға түсіп қалыпты. Бұл да бір кәдеге жарар деп үйіне
              алып келсе, қарғаның аузы ашылмайды.
            </p>

            <p>
              - Бұнысы қалай? – деп қарғаның тұмсығына қараса, жіппен тұмшаланып
              байланып қойыпты.
            </p>

            <p>
              «Обал болған екен» деп шал жіпті шешіп жібергенде, қарға «қарқ»
              етеді де, аузынан бұрқыраған бу шығады. Сол заматта бу алып дәуге
              айналады.
            </p>

            <p>
              - Ей, шал! Сен мені құтқардың. Сол үшін мен саған бала боламын,
              сен маған әке боласың, - дейді әлгі дәу. – Дүниенің бар байлығын
              мен саған тасып беремін.
            </p>

            <p>Сөйтіп, дәу шалға бала болып, солардың үйінде тұрып жатыпты.</p>

            <p>
              Батыр баласы, айтқанындай, бірнеше айлап жол жүріп үйір-үйір жылқы
              мен қора-қора қой әкеліп отырады. Осыдан кейін шал тез байып
              кетеді.
            </p>

            <p>
              Бірақ бұларды қайдан алатынын сұрауға батылы бармайды. Баласынан
              сезіктеніп жүргенде ауылға көріпкел диуана келеді. Шал көріпкел
              диуанаға барып баласының қайда, не істеп жүргенін айтып беруін
              сұрайды.
            </p>

            <p>Көріпкел ойланып-ойланып:</p>

            <p>
              - Балаң алыста, халықты шауып, байлығын тартып алып жүр екен,
              дейді.
            </p>

            <p>Бір күндері артынып-тартынып, мол олжамен дәу де жетеді.</p>

            <p>Баласымен әңгімелесіп отырып, шал:</p>

            <p>
              - Осы, балам, сен шынымен қарғаның ішінен шықтың ба? – деп
              сұрайды.
            </p>

            <p>
              - Иә, әке, қарғаның ішінен шықтым, - деп кеңкілдеп күледі дәу.
            </p>

            <p>Шал жорта сенбеген болып:</p>

            <p>
              - Ойпырмай, шырағым, сенің кереметтігіңді көрейін, кәне, қайтадан
              кіріп көрші, - деп бұрынғы қарғаның аузын тосады.
            </p>

            <p>
              Ақымақ дәу шалды сендірмекші болып, бұрқыраған буға айналып,
              қарғаның ішіне кіріп кетеді. Шалдың күткені де осы еді. Дереу
              аузын жаба қойып, жіппен байлайды да, қарғаны отқа тастап өртеп
              жібереді.
            </p>

            <p>
              Содан бері шал мен кемпір өздерінің баяғы алаңсыз күндерін кешкен
              екен.
            </p>
          </>
        );
      case "tolagai":
        return (
          <>
            <p>
              Бұрынғы өткен заманда, үлкен өзен бойында Саржан деген аңшы өмір
              сүреді, Жылдар жылжып, күндер өткенде оның әйелі Айсұлу өмірге ұл
              әкеліп, қуанған әке-шеше дүбірлетіп той өткізіп, балаға Толағай
              деген ат қояды. Толағай ай санап емес, күн санап өсіп, төрт
              жасында нағыз батырға айналып, жетіге келгенде белдесуге шақ адам
              табылмайды. Әкесімен бірге аңға шығып, атақты аңшыға айналады.
            </p>

            <p>
              Бірде олардың мекеніне жұт келіп, жауын жаумай, қуаңшылық болады.
              Шөлден мал қырылып, адам өледі. Күннің ыстығынан киіз үйді
              паналап, анасымен әңгімелесіп, Толағай одан жаңбырлы жерді
              сұрайды. Анасы таулары аспан тіреген жер жаннаты Тарбағатай жайлы
              ұзақ әңгімелейді.
            </p>

            <p>
              Ол көп жүріп, шыңдарын қар басқан асқар тауларды тауып алып, биік
              тоғайлы, құстары сайрап, төбесін бұлт жапқан бір ғана тауды
              ұнатады. Ол осы тауды құшағына алып, қатты ырғайды да арқасына
              салып, кері еліне қарай қайтады. Ол шаршамай ұзақ жүреді. Халық
              жылжып келе жатқан үлкен тауды көреді. Оны көтеріп келе жатқан
              Толағай екенін біледі. Найзағай ойнап, күн күркіреп, жауын
              селдетеді. Халық "Толағай" деп ұрандап, қуанышпен қарсы алады.
              Қуарған шөп көтеріліп, жан-жануар мөңіреп- азынап шулдайды.
            </p>

            <p>
              Шаршаған батыр тау астынан шыға алмай "Апа!" деген жалғыз ауыз
              сөзге ғана шамасы келеді де, мәңгіге тау астында қалады. Бақытты
              ана айғайлы жылауға басады, халық қайғы жамылып, тау да бұған
              шыдай алмай, көзінен жас бұлақ болып ағады. Содан бері бұл тау
              Толағай деп аталады.
            </p>
          </>
        );
      case "tapqyr-bala":
        return (
          <>
            <p>
              Бұрынғы заманда бір ханның адам тілін білетін қырық есегі болыпты.
              Хан есектерін көзден таса жерде ұстап, сөз үйретеді екен. Содан
              кейін барып, еліне жар салады:
            </p>

            <p>
              - Кімде-кім менің қырық есегіммен отын әкеліп беретін болса,
              қызымды беремін. Отын алып келе алмаса – басын кесемін.
            </p>

            <p>
              Әуелден хан есектерінің сырын білмеген талай адам, есекпен отын
              әкеп беріп қыз алмақ болып, отын алып келе алмай, әуреге түседі.
              Талай адамның басы кесіледі.
            </p>

            <p>
              Сөйтіп, кім отын әкеліп беруге келіссе, хан есектеріне арнайы
              тапсырма беріп жібереді.
            </p>

            <p>
              - Отынға барған соң, сендер айдағанға көнбеңдер. Біреуің
              орындарыңнан қозғамай тұр да, біреуің қозғалмай жатып ал. Бірің
              жүрсең, бірің жүрме. Осы айтқанды орындамасаңдар бәріңді қырамын!
              Хан осылай қорқытады. Есектер ханның жарлығын амалсыз орындайды.
              Таяққа да, қамауға да жан үшін шыдайды.
            </p>

            <p>
              Күндердің бірінде бұл хабарды сол елдегі тапқыр, амалшыл бір жетім
              бала естиді. Ханның алдына келіп, отын әкеліп беруге әзір екенін
              мәлімдейді.
            </p>

            <p>
              - Уәдеңізде тұрасыз ба, тақсыр, қырық есегіңізбен отын әкеліп
              беремін! дейді бала. Хан мысқылдай күледі.
            </p>

            <p>- Мықты болсаң, алып кел!</p>

            <p>
              Бала ханның қырық есегін салып алып, тыпырлата айдап, отын әкелуге
              кетеді. Тауға барып, отын жинайды да, оны қырық есекке артады.
              Содан кейін айдаса, есектер жүрмейді. Ыңыранып жата-жата кетеді.
              Бірін тұрғызса, екіншісі жатады. Бала әбден әбігерге түседі.
              Сөйтіп жүріп, күнді батырады. Бала олай ойлайды, былай ойлайды.
              Ақыры бір амал табады.
            </p>

            <p>
              - Ойбай, қасқыр қаптады. Қараңғы түнде сендермен әуре болып жүріп,
              басымды қасқырға мұжытпайын!- деп тұра қашады.
            </p>

            <p>
              Есектер де шоши бастайды. «Қасқырдың аузына түсіп, мылжанып
              өлгенше, ханның өзі-ақ бауыздап өлтірсін!» деп тіл білетін есектер
              дүркіреп үрке жөнеледі. Табандары жерге тимей, жорта жөнеледі.
              Бәріне отын артылған. Құлақтарын қалқита, пысылдай пысқырынып,
              аулаға топырлай кіреді.
            </p>

            <p>
              - Тақсыр хан, отынды түсіріп, есектеріңізді қораға қамап қойдым,-
              дейді бала. Хан қара терге түскен есектерін, үйіліп жатқан отынды
              көріп шошып кетеді. Сөйтіп, тапқыр бала айлакер ханды отырғызыпты.
            </p>
          </>
        );
      case "aldar-men-bai":
        return (
          <>
            <p>
              Алдар көсе байдың қойын жайыпты. Жайып жүріп, бір күні шықпақ
              болыпты. Байдың баласы жоқ екен. Қойнына ыстық нанды тығып, қойына
              кетіп бара жатса, Алдар көсе келіп:
            </p>

            <p>
              — Бай, сенімен құшақтасып кетейін, — деп, байға келіпті. Байға
              «қош» деп, құшақтасып көрісіпті. Қойнындағы ыстық нан қойнын
              күйгізсе, бай нанды:
            </p>

            <p>— Ит жегір-ай, — деп, лақтырып жіберсе, Алдар көсе:</p>

            <p>— Ит жегенше, мен жейін, — деп, сол арада нанды жеп алыпты.</p>

            <p>
              Байдың үш қызы бар екен. Үлкенінің аты — Жуанбіз, ортаншысының аты
              — Ортаншыбіз, кішісінің аты — Жіңішкебіз екен. Әсіресе, кіші қызы
              сұлу екен. Алдар көсе байға айтыпты:
            </p>

            <p>
              — Байеке, байеке, жіңішке бізіңізді бере тұрсаңыз. Етігімді тігіп
              алайын, — дейді.
            </p>

            <p>Бай:</p>

            <p>— Үйге барсаң, қатын береді, — дейді. Алдар көсе үйіне келіп:</p>

            <p>
              — Бай Жіңішкебізді маған ал деді, — деп, қатынына айтыпты. Қатыны
              «бермеймін» десе, Алдар көсе байға айқай салыпты. Сөйтсе, бай
              ашуланып, қатынына:
            </p>

            <p>
              — Бер, — депті. Қатыны Жіңішкебізді Алдар көсеге беріп жіберіпті.
              Алдар көсе Жіңішкебізді алып келе жатса, бір таз қой бағып жүр
              екен. Алдар көсе тазға айтыпты:
            </p>

            <p>— Тазым, тазым, басыңды жазып берейін бе? — депті. Таз:</p>

            <p>— Мақұл, — депті.</p>

            <p>
              — Көк серкеңді әкел, — деп, серкені сойып, қарнын-жынын таздың
              басына қаптап:
            </p>

            <p>
              — Сен енді осы құдыққа түсіп, жылын. Қасыңа бір ешкі байлап
              қоясың. Сол ешкі маңырағанда, тазың кетеді, — деп, ешкіні байлап
              кетіпті. Сөйтсе, қой кетіп қалыпты. Алдар көсе Жіңішкебізбен келе
              жатса, бір қарт қос айдап жүрсе, сартқа келіп, Алдар көсе қартқа
              айтыпты:
            </p>

            <p>
              — Сарт, мен сенің үйіңнен тамақ ішіп шықтым. Қатының тамағыңды
              даярлап тұр, маған «сен айдай тұр» деді, — депті. Сарт сеніп,
              үйіне кетіп қалса, өгізінің құйрығын кесіп, жерге қадап, екі
              өгізді Жіңішкебізбен бір белдің астына апарып қойып, сартқа
              айқайлапты:
            </p>

            <p>
              — Сартақ сарт, өгізің жерге кіріп кетті, — деп айқайлайды. Сарт
              келіп, құйрықты тартса, Алдар көсе «жұлынады, тартпа» десе, сарт
              болмай, жұлып алыпты.
            </p>

            <p>— Әне, жұлма десем де жұлды.</p>

            <p>Сарт жерді қазып-қазып, таба алмай, сарт үйіне кетіпті.</p>

            <p>Алдар көсе Жіңішкебізді, екі өгізді алып, жолына түсіпті.</p>
          </>
        );
      default:
        return <></>;
    }
  };

  return (
    <>
      <Header />
      <div className="container">
        <div className="text__wrapper">
          <div className="text_left">
            <h1>{renderTitle}</h1>
            <p className="text_img">
              <img src={imgSrc} alt="pic" />
            </p>
            <div className="text__content">{renderText()}</div>
          </div>

          <div className="texts_cards">
            <h2>Басқа ертегілер</h2>
            {shuffle(data)
              .slice(0, 4)
              .map((el, idx) => (
                <Card
                  key={idx}
                  title={el.title}
                  img={el.image}
                  link={el.link}
                  text={el.text}
                  type="row"
                />
              ))}
          </div>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default Text;
