import imgSrc from "../../audio/author-photo.jpeg";
import Footer from "../../components/footer";
import Header from "../../components/header";
const About = () => {
  const renderText = () => {
    return (
      <>
        <p>
          «Солтүстік Қазақстан облысы әкімдігінің білім басқармасы» КММ
          «Петропавл қаласының білім бөлімі» КММ «Сафуан Шаймерденов атындағы
          қалалық классикалық гимназиясы» КММ
        </p>
        <p className="about_hight_text">
          Абишева Камшат Сырымқызы
          <br /> Бастауыш сынып мұғалімі
          <br /> <b>Санаты:</b> педагог-шебер, п.ғ. магистрі
          <br /> <b>Еңбек өтілі:</b> 24 жыл
        </p>
      </>
    );
  };

  return (
    <>
      <Header />
      <div className="container">
        <div className="about_wrapper">
          <h1>Сайт жайлы</h1>
          <div className="about_left">
            <p className="about_img">
              <img src={imgSrc} alt="pic" />
            </p>
            <div className="text__content">{renderText()}</div>
          </div>
          <div className="about_title">
            <b>Сайттың атауы:</b> «Қазақ ертегілерінің бірегей жинағы»
          </div>
          <section>
            <h3>Сайт не туралы?</h3>
            <p>
              Бұл сайтта балалардың қазақ ертегілеріне деген қызығушылығын
              арттыру жолдары қарастырылады. Қазақ ертегілері - ұлттың бай
              мәдениеті мен рухани құндылықтарының айқын көрінісі болып
              табылады, сондықтан оларды балаларға таныту маңызды. Ертегілер
              балаларға қызықты әңгімелер ұсына отырып, олардың рухани,
              моральдық және дүниетанымдық дамуына ықпал етеді. Ертегілерді
              арнайы платформа - сайт арқылы, интерактивті тәсілдермен жеткізу
              арқылы балалардың қызығушылығын арттырудың тиімді әдістері
              талқыланады. Сонымен қатар, қазақ ертегілері тақырыбын сабақтарда
              тиімді қолдану және ертегілердің әлеуметтік желілер мен мобильді
              қосымшалар арқылы насихатталуы да маңызды мәселелер ретінде
              қарастырылады.
            </p>
            <p>
              Қазақ ертегілеріне деген қызығушылықты қазіргі ғылым мен
              техниканың дамыған заманына сай қалай жетілдіру және насихаттау
              жолдарын ұсынамын. Балалардың қазақ ертегілеріне деген
              қызығушылығын арттыру үшін осы әдістерді үйлесімді түрде қолдану
              қажет.
            </p>
            <p>
              <b>Сайттың мақсаты</b> – қазақ халқының бай ауыз әдебиеті
              мұраларын сақтап, ұрпақтан-ұрпаққа жеткізу. Бұл сайтта қазақ
              ертегілерінің түрлері пазл ойыны, мәтін, ертегілерді бояу
              каталогы, мультфильмдер жинақталып, оқырмандарға қолжетімді
              болады.
            </p>
            <p>
              <b>Сайттың басты міндеті </b>– қазақ ертегілерін заманауи әдістер
              арқылы түрлі форматта (мәтін, аудио, видео, ойын) ұсыну. Сонымен
              қатар, қазақ мәдениеті мен тілін насихаттап, жас ұрпақтың ұлттық
              құндылықтарды меңгеруіне үлес қосу.
            </p>
          </section>

          <section>
            <p>
              <div className="about_title">
                <b> «Қазақ ертегілерінің бірегей жинағы»</b> сайтының
                сипаттамасы
              </div>
              Сайт 4 бөлімнен тұрады. Олар: «Пазл ойыны», «Ертегі оқу», «Асық
              ойыны», «Кейіпкерлерді бояу бөлімдері».
            </p>
            <article>
              <h3>«Пазл ойыны» бөлімі:</h3>
              <p>
                Бұл бөлімде балалар қазақ ертегілерінің кейіпкерлері мен
                оқиғаларын пазл жинағын құрастыру арқылы танысады. Әр ертегіге
                арналған пазл бөліктері ұсынылып, оларды дұрыс жинақтау үшін
                бала әрбір сурет бөлігін дұрыс орнына орналастырады. Бөлімде
                «Тау көтерген Толағай», «Қаңбақ шал», «Мақта қыз бен мысық»,
                «Тазша бала», «Алдар Көсе» сияқты қазақ ертегілерінің
                кейіпкерлері мен маңызды көріністері бейнеленген пазл суреттері
                болады.
              </p>

              <strong>Ойынның барысы:</strong>

              <ol>
                <li>
                  <strong>Ертегі таңдау:</strong> Балалар ойын бастау үшін
                  өздеріне ұнайтын ертегіні таңдайды. Әр ертегіге сәйкес пазл
                  жинақтары ұсынылады. Қалаған ертегіні таңдау арқылы бала сол
                  ертегінің кейіпкерлері мен оқиғасын меңгеруге кіріседі.
                </li>
                <li>
                  <strong>Пазл жинау:</strong> Ойыншы таңдап алған ертегісінің
                  пазл бөліктерін жинақтай бастайды. Пазл бөліктері түсінікті
                  әрі қарапайым түрде бөлінген, сондықтан балаға оларды дұрыс
                  жинақтау қиындық тудырмайды. Әр бөлік белгілі бір кейіпкерді
                  немесе маңызды оқиғаны бейнелейді.
                </li>
                <li>
                  <strong>QR кодты сканерлеу:</strong> Пазл дұрыс жинақталғаннан
                  кейін, бала QR кодты сканерлеу арқылы сол ертегі туралы
                  мультфильмді көре алады. Мультфильмдер балаларға ертегі
                  әлеміне толығымен еніп, кейіпкерлердің әрекеттерін көруге
                  мүмкіндік береді.
                </li>
                <li>
                  <strong>Мультфильмді көру:</strong> QR кодты сканерлеу арқылы
                  ертегі кейіпкерлері туралы толық мультфильмді көруге болады.
                  Бұл балаларға ертегіні тек сөзбен емес, бейнеленген түрде де
                  ұғынуға көмектеседі.
                </li>
              </ol>
            </article>
            <article>
              <h3>«Ертегі оқу» бөлімі:</h3>
              <p>
                Бұл бөлімде балалар қазақ ертегілерінің толық нұсқаларын оқып,
                сол ертегілердің суреттерін тамашалай алады. «Қарлығаштың
                құйрығы неге айыр?», «Жыл басына таласқан хайуанаттар», «Шал мен
                дәу», «Шықбермес Шығайбай», «Тау көтерген Толағай», «Қаңбақ
                шал», «Тазша бала», «Тапқыр бала», «Алдар Көсе мен Бай» сияқты
                қазақ халқының бай ауыз әдебиетіндегі танымал ертегілері
                балаларға қызықты әрі тәрбиелік мәні зор оқиғалар арқылы
                ұсынылады.
              </p>
            </article>
            <article>
              <h3>«Асық ойыны» бөлімі:</h3>
              <p>
                Бұл бөлімде балаларға қазақ ертегілерінің мультфильмдерін көріп,
                қызықты әрі білімді ойын ойнауға мүмкіндік беретін «Асық ойыны»
                ұсынылады. Ойынның негізінде әр асыққа қазақ ертегілерінің
                кейіпкерлері мен оқиғаларының суреттері бейнеленген. Әр асықтың
                жанында QR код бар, оны сканерлеу арқылы бала әр ертегі бойынша
                толық мультфильмді тамашалай алады. Бұл бөлім балаларға қазақ
                ертегілерін әрі ойын, әрі мультфильм арқылы үйренуге мүмкіндік
                береді.
              </p>
            </article>
            <article>
              <h3>«Кейіпкерлерді бояу» бөлімі:</h3>
              <p>
                Бұл бөлімде балаларға қазақ ертегілерінің танымал кейіпкерлерін
                бояу арқылы танысуға мүмкіндік беріледі. «Алдар Көсе», «Ер
                Төстік», «Мақта қыз бен мысық», «Қарлығаштың құйрығы неге
                айыр?», «Жыл басына таласқан хайуанаттар» сияқты қазақ
                ертегілерінің кейіпкерлері бейнеленген каталог ұсынылады.
              </p>

              <strong>Каталогтың құрылымы:</strong>

              <ul>
                <li>
                  <strong>Сол жақ беті:</strong> Әр ертегінің толық боялған
                  нұсқасы орналасқан. Бұл балаларға ертегі кейіпкерлерінің
                  қандай болуы керек екенін көрсету үшін үлгі ретінде ұсынылады.
                  Бұл сурет балалардың ертегі кейіпкерінің ерекшеліктерін
                  түсініп, бояу кезінде қандай түстер қолдануға болатынын
                  көрсетуге көмектеседі.
                </li>
                <li>
                  <strong>Оң жақ беті:</strong> Сол суреттің боялмаған, бірақ
                  контурлары бар нұсқасы берілген. Балалар осы беттегі суретті
                  өздері бояу арқылы шығармашылық қабілеттерін дамыта алады.
                  Бояу кезінде әр бала өз таңдауы мен қиялына қарай түрлі
                  түстерді пайдаланып, ертегі кейіпкерлерін жандандырады.
                </li>
              </ul>
            </article>
          </section>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default About;
