import React from "react";
const Footer = () => {
  return (
    <div className="footer">
      <div className="container">
        <div>
          <h3>Сайт жайлы</h3>
          <p>
            Біздің сайттағы қазақ ертегілерінің қызықты әлеміне еніңіз! Бізде
            қазақша ертегілердің бірегей жинағы бар. Ертегілер бұл қызықты оқу
            ғана емес, сонымен қатар ежелгі дәстүрлердің атмосферасына ену,
            халықтың құндылықтары мен даналығын түсіну мүмкіндігі.Әр оқиға
            жарқын бейнелермен, қызықты сюжеттермен және өмір сабақтарымен
            қаныққан. Біздің сайтта қазақ ертегілерін оқыңыз, бұл еліміздің
            мәдениеті мен дәстүрлерімен танысудың тамаша тәсілі. Дәл қазір
            ғажайыптар мен сиқырлар әлеміне еніңіз!
          </p>
        </div>
      </div>
    </div>
  );
};

export default Footer;
