import aldar from "../../audio/aldar_men_bay.jpg";
import maqtaQyz from "../../audio/maqta-qyz.png";
import qanbaqShal from "../../audio/qanbaq-shal.png";
import qarlygash from "../../audio/qarlygash.jpg";
import shalMenDau from "../../audio/shal_men_dau.jpg";
import tazshaBala from "../../audio/tazsha-bala.png";
import tolagay from "../../audio/tolagay.png";
import wyqbermes from "../../audio/wyqbermes.webp";
import khaiuanattar from "../../audio/zhyl_basyna.gif";
import Card from "../../components/card/index";
import Footer from "../../components/footer";
import Header from "../../components/header";
export const data = [
  {
    title: "Қарлығаштың құйрығы неге айыр?",
    image: qarlygash,
    link: "qarlygashtyn-quirygy-nege-aiyr",
    text: "Күндердің бір күні Жылан жер жүзіндегі жанды мен жансыздарға мынадай арыз айтады:  — Мені Тәңірім сендердің бәріңнен кем жаратыпты. Аяқ-қолым жоқ. Басымды көтере алмай, жер бауырлап қалдым.",
  },

  {
    title: "Жыл басына таласқан хайуанаттар",
    image: khaiuanattar,
    link: "khaiuanattar",
    text: "Ерте заманда хайуандар жылдың басы болуға таласыпты. Сонда жылқы айтыпты: — Мен алысты жақын қыламын. Күшімді көреді, сүтімді ішеді, қылыма шейін арқан, жіп еседі. Адамға менен пайдалы мал жоқ, жыл ағасы мен боламын, – дейді.",
  },
  {
    title: "Шал мен дәу",
    image: shalMenDau,
    link: "shal-men-dau",
    text: "Ерте, ерте, ертеде, ертеден де ертеде бір кемпір мен шал өмір сүріпті. Олардың баласы болмапты және өздері кедей екен. Шал аң аулап, екеуі сөйтіп күндерін көріпті. Бір күні шалдың құрып қойған торына бір қарға түсіп қалыпты. Бұл да бір кәдеге жарар деп үйіне алып келсе, қарғаның аузы ашылмайды.",
  },
  {
    title: "Шықбермес Шығайбай",
    image: wyqbermes,
    link: "shygaibai",
    text: "Ерте заманда, елдің етек – жеңі келте заманда, Шықбермес Шығайбай дейтін сараң бай болыпты. Мал – мүлкінде есеп болмапты. Бірақ байлығымен аты шықпай, сараңдығымен аты шығыпты... Сол Шықбермес Шығайбай үйіне ешкімді қондырмайды екен, қондырса да дәм беріп оңдырмайды екен. Үйіне кісі келсе, жоғары шық деудің орнына айтатын сөзі: «Шық, ай!» болыпты. Осыдан жұрт оны Шығайбай деп атап кеткен екен.",
  },
  {
    title: "Тау көтерген Толағай",
    image: tolagay,
    link: "tolagai",
    text: "Бұрынғы өткен заманда, үлкен өзен бойында Саржан деген аңшы өмір сүреді, Жылдар жылжып, күндер өткенде оның әйелі Айсұлу өмірге ұл әкеліп, қуанған әке-шеше дүбірлетіп той өткізіп, балаға Толағай деген ат қояды. Толағай ай санап емес, күн санап өсіп, төрт жасында нағыз батырға айналып, жетіге келгенде белдесуге шақ адам табылмайды. Әкесімен бірге аңға шығып, атақты аңшыға айналады.",
  },
  {
    title: "Қаңбақ шал",
    image: qanbaqShal,
    link: "qanbaq-shal",
    text: "Бұрын, бұрын, бұрында Қаңбақ шал деген шал болыпты. Мал мен басқа зар болыпты. Кедейліктен шықпапты. Ол ау салып, балық ұстап, тамақ асырапты. Жел соқса, шал домалап жөнеледі екен. Содан оған Қаңбақ шал деп ат қойылған екен. Күн сайын ауына ілінген екі балығының біреуін бір түлкі әлімжеттік қып тартып жей береді екен. ",
  },

  {
    title: "Мақта қыз бен мысық",
    image: maqtaQyz,
    link: "maqta-qyz-ben-mysyk",
    text: "Баяғыда Мақта қыз болыпты. Мақта қыз үйін жинап жүріп, бір мейіз тауып алады да, мысықты шақырады, Мысық келмейді. Қыз: – Келмесең келме! – деп, мейізді өзі жеп қояды.",
  },
  {
    title: "Тазша бала",
    image: tazshaBala,
    link: "tazsha-bala",
    text: "Ертеде бір шал мен кемпір болыпты. Олардың үш баласы, бес ешкісі бар екен. Бір күні үлкен баласы басқа жерден пайда кәсіп қылуға талап етіп, өзіне тиген енші ешкісін сойып алып, етінен кемпір мен шалға бір түйір де берместен, арқалап кетіпті. Келе жатса, бір өнерші байдікіне келеді.",
  },
  {
    title: "Тапқыр бала",
    image: khaiuanattar,
    link: "tapqyr-bala",
    text: "Бұрынғы заманда бір ханның адам тілін білетін қырық есегі болыпты. Хан есектерін көзден таса жерде ұстап, сөз үйретеді екен. Содан кейін барып, еліне жар салады:",
  },
  {
    title: "Алдар Көсе мен Бай",
    image: aldar,
    link: "aldar-men-bai",
    text: "Алдар көсе байдың қойын жайыпты. Жайып жүріп, бір күні шықпақ болыпты. Байдың баласы жоқ екен. Қойнына ыстық нанды тығып, қойына кетіп бара жатса, Алдар көсе келіп:",
  },
];
const Texts = () => {
  return (
    <>
      <Header />
      <div className="container">
        <div className="card__wrapper">
          <h1>Қазақша ертегілер</h1>
          <div className="cards">
            {data.map((el, idx) => (
              <Card
                key={idx}
                title={el.title}
                img={el.image}
                link={el.link}
                text={el.text}
              />
            ))}
          </div>
        </div>
      </div>
      <Footer />
    </>
  );
};

export default Texts;
